WSC_I64B71/CFD/0/impParticleForces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      impParticleForces;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -2 0 0 0 0];

internalField   nonuniform List<vector> 
600
(
(4.83555e-05 -3.0799e-08 9.18078e-08)
(4.76159e-05 -3.75737e-08 1.38008e-07)
(4.69893e-05 -4.2955e-08 1.94796e-07)
(4.66859e-05 -4.41014e-08 2.51034e-07)
(4.65506e-05 -4.25819e-08 2.80297e-07)
(4.63782e-05 -4.30029e-08 2.82719e-07)
(4.64272e-05 -4.80059e-08 2.61651e-07)
(4.63459e-05 -5.45546e-08 2.21493e-07)
...
)
;

boundaryField
{
    wall_bottom
    {
        type            calculated;
        value           uniform (4.85065e-05 -2.9403e-08 8.29949e-08);
    }
    wall_top
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    front1
    {
        type            cyclic;
    }
    back1
    {
        type            cyclic;
    }
    left1
    {
        type            cyclic;
    }
    right1
    {
        type            cyclic;
    }
    front2
    {
        type            cyclic;
    }
    back2
    {
        type            cyclic;
    }
    left2
    {
        type            cyclic;
    }
    right2
    {
        type            cyclic;
    }
    front3
    {
        type            cyclic;
    }
    back3
    {
        type            cyclic;
    }
    left3
    {
        type            cyclic;
    }
    right3
    {
        type            cyclic;
    }
}


// ************************************************************************* //
